Revit 2027 API
FabricationPart.SetSeamInfo Method
 Sets the seam information for the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSeamInfo(
	int seamIndex,
	int seamId,
	bool locked
)
Public Sub SetSeamInfo (
	seamIndex As Integer,
	seamId As Integer,
	locked As Boolean
)
public:
void SetSeamInfo(
	int seamIndex,
	int seamId,
	bool locked
)
member SetSeamInfo :
        seamIndex : int *
        seamId : int *
        locked : bool -> unit
Parameters
seamIndex Int32
 The index of the seam to set.
seamId Int32
 The identifier of the seam to set.
locked Boolean
 If true the seam will be locked and not changed by automatic processes.
Exceptions
Exception | Condition
ArgumentException |  The seam identifier is not valid.
ArgumentOutOfRangeException |  The seam index is out of valid range.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace